controllers/AuthorController.php

    public function actionCreate()
       {

		$model = new Author();
		if ($model->load(Yii::$app->request->post()) &&$model->save())
---
INSERT INTO `author` (`first_name`, `last_name`, `birthdate`, `rating`) VALUES ('TInica', 'Cristian', NULL, NULL)

    public function actionIndex()
    {

		$authorsList = Author::find()->all();
---
SELECT * FROM `author`

    public function actionUpdate($id)
    {
		$model =Author::findOne($id);
		if ($model->load(Yii::$app->request->post()) &&$model->save())
---
SELECT * FROM `author` WHERE `id`='5'