controllers/BookShopController.php

    public function actionIndex()
    {
		$this->enableCsrfValidation = false;
		$conditions = ['publisher_id'=>1];
		//$bookList = Book::find()->where($conditions)->orderBy('date_published')->limit(2)->all();
		$bookList = Book::find()->orderBy('date_published')->limit(20)->all();
---
SELECT * FROM `book` ORDER BY `date_published` LIMIT 20

	public function actionCreate()
	{

		$book = new Book();
		$publisher = Publisher::getList();
		if($book->load(Yii::$app->request->post()) && $book->save())
---
INSERT INTO `book` (`name`, `publisher_id`) VALUES ('Author23', 1)