models/Book.php

	public function getPublisher()
	{
	return $this->hasOne(Publisher::className(),['id'=>'publisher_id'])->one();
---
SELECT * FROM `publisher` WHERE 0=1

		public function getAuthors()
		{
		return $this->hasMany(Author::className(),['id'=>'author_id'])->via('bookToAuthorRelations')->all();
---
SELECT * FROM `author` WHERE 0=1