models/Publisher.php

    public static function getList()
    {
		$list = self::find()->asArray()->all();
---
SELECT * FROM `publisher`